[
	"Deer can’t eat hay.",
	"It’s against the law to burp, or sneeze in a church in Nebraska, USA.",
	"The word “samba” means “to rub navels together.”",
	"The strongest muscle in the body is the tongue.",
	"The mask used by Michael Myers in the original film “Halloween” was actually a Captain Kirk mask painted white.",
	"You can tell the sex of a horse by its teeth. Most males have 40, females have 36.",
	"Leonardo Da Vinci invented the scissors.",
	"Nutmeg is extremely poisonous if injected intravenously.",
	"The fingerprints of koala bears are virtually indistinguishable from those of humans, so much so that they can be easily confused at a crime scene.",
	"An ostrich’s eye is bigger than its brain.",
	"When you tie a noose, the rope is wrapped twelve times around because it’s the same length as a persons head.",
	"‘Obsession’ is the most popular boat name.",
	"Porcupines float in water.",
	"Most toilets flush in E flat.",
	"There are 1,575 steps from the ground floor to the top of the Empire State building. [link]",
	"The longest recorded flight of a chicken is thirteen seconds.",
	"Thirty-five percent of the people who use personal ads for dating are already married.",
	"In 1778, fashionable women of Paris never went out in blustery weather without a lightning rod attached to their hats.",
	"The name Jeep came from the abbreviation used in the army. G.P. for ‘General Purpose’ vehicle.",
	"February 1865 is the only month in recorded history not to have a full moon.",
	"Meteorologists claim they’re right 85% of the time (think about that one!)",
	"The praying mantis is the only insect that can turn its head",
	"Facetious and abstemious contain all the vowels in the correct order, as does arsenious, meaning “containing arsenic.”  ",
	"The average lead pencil will draw a line 35 miles long or write approximately 50,000 English words.",
	"An ostrich’s eye is bigger that it’s brain.",
	"Over 75% of people who read this will try to lick their elbow.",
	"Only one person in two billion will live to be 116 or older.",
	"In 1386, a pig in France was executed by public hanging for the murder of a child",
	"Outside the USA, Ireland is the largest software producing country in the world.",
	"One quarter of the bones in your body, are in your feet!",
	"A cat’s jaw cannot move sideways.",
	"70% of all boats sold are used for fishing.",
	"A duck’s quack doesn’t echo, and no one knows why.",
	"Ethernet is a registered trademark of Xerox, Unix is a registered trademark of AT&T.",
	"The city with the most Roll Royces per capita: Hong Kong",
	"Adolf Hitler was a vegetarian, and had only ONE testicle.",
	"First novel ever written on a typewriter: Tom Sawyer",
	"A piece of paper can be folded no more then 9 times.",
	"Barbie’s measurements, if she were life-size, would be 39-29-33.",
	"The plastic things on the end of shoelaces are called aglets.",
	"People say “Bless you” when you sneeze because when you sneeze,your heart stops for a mili-second.",
	"A crocodile can’t move its tongue and cannot chew. Its digestive juices are so strong that it can digest a steel nail.",
	"The average person falls asleep in seven minutes.",
	"Einstein couldn’t speak fluently until after his ninth birthday. His parents thought he was mentally retarded.",
	"One-fourth of the world’s population lives on less than $200 a year.  Ninety million people survive on less than $75 a year.",
	" Women blink nearly twice as much as men.",
	"Daylight Saving Time is not observed in most of the state of Arizona and parts of Indiana.",
	"Most Egyptians died by the time they were 30 about 300 years ago,",
	"In Cleveland, Ohio, it’s illegal to catch mice without a hunting license.",
	"Honey is the only food which does not spoil.",
	"Thirty-five percent of the people who use personal ads for dating are already married.",
	"Hydrogen gas is the least dense substance in the world, at 0.08988g/cc.  Hydrogen solid is the most dense substance in the world, at 70.6g/cc.",
	"When possums are playing ‘possum’, they are not “playing.” They actually pass out from sheer terror.",
	"Sound travels 15 times faster through steel than through the air.",
	"The world’s youngest parents were 8 and 9 and lived in China in 1910.",
	"If you yelled for 8 years, 7 months and 6 days, you will have produced enough sound energy to heat one cup of coffee.",
	"If a rooster can’t fully extend its neck, it can’t crow.",
	"The Ramses brand condom is named after the great pharoh Ramses II who fathered over 160 children.",
	"The national anthem of Greece has 158 verses.  No one in Greece has memorized all 158 verses.",
	"All of the clocks in the movie Pulp Fiction are stuck on 4:20.",
	"In the White House, there are 13,092 knives, forks and spoons!",
	"The three most recognized Western names in China are Jesus Christ, Richard Nixon, & Elvis Presley.",
	"In The Empire Strikes Back there is a potato hidden in the asteroid field",
	"Einstein couldn’t speak fluently when he was nine. His parents thought he might be retarded.",
	"Polar bears are left handed.",
	"Ketchup was sold in the 1830s as medicine",
	"Napoleon’s penis was sold to an American Urologist for $40,000. [link]",
	"Starfish haven’t got brains.",
	"The Black Widow spider eats her mate during or after sex.",
	"40,000 Americans are injured by toilets each year.",
	"5,840 people with pillow related injuries checked into U.S. emergency rooms in 1992.",
	"More than 50% of the people in the world have never made or received a telephone call.",
	"If NASA sent birds into space they would soon die; they need gravity to swallow.",
	"Conception occurs most in the month of December.",
	"Coca-Cola was originally green.",
	"The amount of computer Memory required to run WordPerfect for Win95 is 8 times the amount needed aboard the space shuttle.",
	"On average, people fear spiders more than they do death.",
	"The airplane Buddy Holly died in was the “American Pie.” (Thus the name of the Don McLean song.)",
	"There are two credit cards for every person in the United States.",
	"You burn more calories sleeping than you do watching TV.",
	"Van Gogh only sold one painting when he was alive.",
	"Thirty-five percent of people who use personal ads for dating are already married.",
	"If you farted consistently for 6 years and 9 months, enough gas is produced to create the energy of an atomic bomb.",
	"The microwave was invented after a researcher walked by a radar tube and a chocolate bar melted in his pocket.",
	"The first contraceptive was crocodile dung used by the ancient Egyptians.",
	"Leonardo da Vinci could write with one hand while drawing with the other",
	"Intelligent people have more zinc and copper in their hair.",
	"The king of hearts is the only king without a mustache.",
	"A cat has 32 muscles in each ear.",
	"Of all the words in the English language, the word ’set’ has the most definitions!",
	"Ostriches are often not taken seriously. They can run faster than horses, and the males can roar like lions.",
	"A dragonfly has a lifespan of 24 hours.",
	"Table tennis balls have been known to travel off the paddle at speeds up to 160 km/hr.",
	"On average, dogs have better eyesight than humans, although not as colorful.",
	"The “save” icon on Microsoft Word shows a floppy disk with the shutter on backwards.",
	"You can’t kill yourself by holding your breath.  ",
	"A cat has 32 muscles in each ear.",
	"The male gypsy moth can “smell” the virgin female gypsy moth from 1.8 miles away.  ",
	"111,111,111 x 111,111,111 = 12,345,678,987,654,321",
	"Intelligent people have more zinc and copper in their hair.",
	"PEZ candy even comes in a Coffee flavor.",
	"A man named Charles Osborne had the hiccups for 69 years!",
	"Every acre of American crops harvested contains 100 pounds of insects.",
	"A raisin dropped in a glass of fresh champagne will bounce up and down continually from the bottom of the glass to the top.",
	"A shrimp’s heart is in it’s head.",
	"Poland is the “stolen car capital of the world”.",
	"Venus is the only planet that rotates clockwise.",
	"Over 1000 birds a year die from smashing into windows!",
	"There are 293 ways to make change for a dollar.",
	"When a Hawaiian woman wears a flower over her left ear, it means that she is not available.",
	"Human birth control pills work on gorillas.",
	"60% of electrocutions occur while talking on the telephone during a thunderstorm.",
	"The giant red star Betelgeuse has a diameter larger than that of the Earth’s orbit around the sun.",
	"A pregnant goldfish is called a twit.",
	"Winston Churchill was born in a ladies’ room during a dance.",
	"Tigers have striped skin, not just striped fur.",
	"In the last 3,500 years, there have been approximately 230 years of peace throughout the civilized world.",
	"Every person has a unique tongue print as well as fingerprints.",
	"A giraffe can clean its ears with its 21-inch tongue!",
	"A blind chameleon still changes colors to match his environment.",
	"The Portuguese jellyfish tentacles have been known to grow a mile in length, catching anything in it’s path by stinging it’s prey.",
	"Icelanders consume more Coca-Cola per Capita than any other nation.",
	"A hedgehog’s heart beats 300 times a minute on average.",
	"Dueling is legal in Paraguay as long as both parties are registered blood donors.",
	"Between 25% and 33% of the population sneeze when exposed to light.",
	"The most common name in world is Muhammad.",
	"Mount Olympus Mons on Mars is three times the size of Mount Everest.",
	"Most toilets flush in E flat.",
	"2,000 pounds of space dust and other space debris fall on the Earth every day.",
	"Approximately 40,000 Americans are injured by toilets each year.",
	"Each month, there is at least one report of UFOs from each province of Canada.",
	"You can be fined up to $1,000 for whistling on Sunday in Salt Lake City, Utah.",
	"It takes about 142.18 licks to reach the center of a Tootsie pop.",
	"The serial number of the first MAC ever produced was 2001.",
	"There is a town in Newfoundland, Canada called Dildo.",
	" All 50 states are listed across the top of the Lincoln Memorial on the back of the $5 bill.",
	"In space, astronauts are unable to cry, because there is no gravity and the tears won’t flow.",
	"Chewing gum while peeling onions will keep you from crying.",
	"There are more plastic flamingos in the U.S that there are real ones.",
	"During it’s lifetime an oyster changes its sex from male to female and back several times.",
	"Cephalacaudal recapitulation is the reason our extremities develop faster than the rest of us.",
	"Nutmeg is extremely poisonous if injected intravenously.",
	"Daniel Boone hated coonskin caps.",
	"More people speak English in China than the United States.",
	"All the swans in England are property of the Queen.",
	"The town of Calma, Chile in the Atacama Desert has never had rain.",
	"Cleveland spelled backwards is DNA level C.",
	"Winston Churchill was born in a ladies room during a dance.",
	"A normal raindrop falls at about 7 miles per hour.",
	"The average person falls asleep in seven minutes.",
	"There are 336 dimples on a regulation golf ball.",
	"‘Stewardesses’ is the longest word that is typed with only the left hand.",
	"The “pound” key on your keyboard (#) is called an octotroph.",
	"The only domestic animal not mentioned in the Bible is the cat.",
	"During his entire life, Vincent Van Gogh sold exactly one painting, “Red Vineyard at Arles”.",
	"Certain species of male butterflies produce scents that serve in attracting females during courtship.",
	"There are no clocks in Las Vegas gambling casinos.",
	"Male bees will try to attract sex partners with orchid fragrance.",
	"On a Canadian two-dollar bill, the American flag is flying over the Parliament Building.",
	"In the Arctic, the sun sometimes appears to be square.",
	"Non-dairy creamer is flammable.",
	"Stewardesses is the longest word typed with only the left hand.",
	"Camel’s have three eyelids.",
	"The average person laughs 10 times a day!",
	"A healthy (non-colorblind) human eye can distinguish between 500 shades of gray.",
	"A syzygy occurs when three atronomical bodies line up.",
	"Shakespeare invented the word “assassination” and “bump.”",
	"Your heart beats over 100,000 times a day!",
	"The Beetham Tower has 47 floors.",
	"A duck’s quack doesn’t echo, and no one knows why.",
	"Elwood Edwards did the voice for the AOL sound files (i.e. “You’ve got Mail!”).",
	"Americans are responsible for about 1/5 of the world’s garbage annually.",
	"Lizards can self-amputate their tails for protection. It grows back after a few months.",
	"The most frequently named bugs from the Bible are: Locust: 24, Moth: 11, Grasshopper: 10, Scorpion: 10, Caterpillar: 9, and Bee: 4.",
	"Our eyes are always the same size from birth, but our nose and ears never stop growing.",
	"In Utah, it is illegal to swear in front of a dead person.",
	"Due to precipitation, for a few weeks, K2 is taller than Mt. Everest.",
	"A scholar who studies the Marquis de Sade is called a Sadian not a Sadist.",
	"What is called a “French kiss” in the English speaking world is known as an “English kiss” in France.",
	"It’s estimated that at any one time around 0.7% of the world’s population is drunk.",
	"Like fingerprints, everyone’s tongue print is different!",
	"Everyday, more money is printed for Monopoly sets than for the U.S. Treasury.",
	"There is a hotel in Sweden built entirely out of ice; it is rebuilt every year.",
	"Intelligent people have more zinc and copper in their hair.",
	"The average talker sprays about 300 microscopic saliva droplets per minute, about 2.5 droplets per word.",
	"The Earth experiences 50,000 Earthquakes per year and is hit by Lightning 100 times a second.",
	"Every year 11,000 Americans injure themselves while trying out bizarre sexual positions.",
	"If we had the same mortality rate now as in 1900, more than half the people in the world today would not be alive.",
	"On average, Americans eat 18 acres of pizza everyday.",
	"The Romans used to make toothpaste from urine.",
	"Catfish are the only animals that naturally have an odd number of whiskers.",
	"Your ribs move about 5 million times a year, everytime you breathe.",
	"Nutmeg is extremely poisonous if injected intravenously",
	"A cockroach will live nine days without it’s head, before it starves to death.",
	"A species of earthworm in Australia grows up to 10 feet in length.",
	"An ostrich’s eye is bigger than its brain.",
	"A female swine, or a sow, will always have a even number of teats or nipples, usually twelve.",
	"It takes 8.5 minutes for light to get from the sun to earth.",
	"Lightning strikes the earth about 8 million times a day.",
	"Non-dairy creamer is flammable.",
	"The airplane Buddy Holly died in the “American Pie.” (Thus the name of the Don McLean song.)",
	"Golf courses cover 4% of North America.",
	"The average person will accidentally eat just under a pound of insects every year.",
	"Until 1994, world maps and globes sold in Albania only had Albania on them.",
	"The only real person to be a Pez head was Betsy Ross.",
	"When the University of Nebraska Cornhuskers play football at home, the stadium becomes the state’s third largest city.",
	"A dragonfly has a lifespan of 24 hours.",
	"A goldfish has a memory span of three seconds.",
	"A dime has 118 ridges around the edge.",
	"If you yelled for 8 years, 7 months and 6 days, you would have produced enough sound energy to heat one cup of coffee.",
	"The strongest muscle in proportion to its size in the human body is the tongue.",
	"Every time you lick a stamp, you’re consuming 1/10 of a calorie.",
	"The human heart creates enough pressure when it pumps out to the body to squirt blood 30 feet.",
	"Banging your head against a wall uses 150 calories an hour.",
	"It takes a sloth two weeks to digest the food it eats.",
	"2,000 pounds of space dust and other space debris fall on the Earth everyday.",
	"Sherlock Holmes NEVER said, “Elementary, my dear Watson.”",
	"God is not mentioned once in the book of Esther.",
	"The skeleton of Jeremy Bentham is present at all important meetings of the University of London",
	"Orville Wright was involved in the first aircraft accident. His passenger, a Frenchman, was killed.",
	"Andorra, a tiny country between France & Spain, has the longest average lifespan: 83.49 years.",
	"All porcupines float in water.",
	"Ever wonder where the phrase two bits came from? Some coins used in the American colonies before the Revolutionary War were Spanish dollars, which could be cut into pieces, or bits. Since two pieces equaled one-fourth dollar, the expression two bits came into being as a name for 25 cents.",
	"Paraskevidekatriaphobia means fear of Friday the 13th, which occurs one to three times a year.",
	"Rats and horses can’t vomit.",
	"Netherlands is the only country with a national dog.",
	"Ancient Egyptian priests would pluck every hair from their bodies.",
	"About seven million cars are junked each year in the U.S.",
	"A rodents teeth never stop growing. They are worn down by the animal’s constant gnawing on bark, leaves, and other vegetables.",
	"Camel’s milk does not curdle.",
	"American Airlines saved $40,000 in 1987 by eliminating one olive from each salad served in first class.",
	"In 1933, Mickey Mouse, an animated cartoon character, received 800,000 fan letters.",
	"Flies jump backwards during takeoff.",
	"Benjamin Franklin was the fifth in a series of the youngest son of the youngest son.",
	"Human thigh bones are stronger than concrete.",
	"The people of Israel consume more turkeys per capita than any other country.",
	"In Quebec, there is an old law that states margarine must be a different color than butter.",
	"A “quidnunc” is a person who is eager to know the latest news and gossip.",
	"It’s possible to lead a cow upstairs…but not downstairs.",
	"Human thighbones are stronger than concrete.",
	"A group of hares is called a Husk.",
	"There are more than 10 million bricks in the Empire State Building.",
	"Dreamt is the only English word that ends in the letters “MT”.",
	"In New York State, it is illegal to but any alcohol on Sundays before noon.",
	"98% of Japanese are cremated.",
	"For every ‘normal’ webpage, there are five porn pages.",
	"Arnold Schonberg suffered from triskaidecphobia, the fear of the number 13. He died 13 minutes from midnight on Friday the 13th.",
	"Montpelier, Vermont is the only state capital without a McDonalds.",
	"A cow gives nearly 200,000 glasses of milk in her lifetime.",
	"Cuba is the only island in the Caribbean to have a railroad.",
	"Earthworms have 5 hearts.",
	"People say “bless you” when you sneeze because your heart stops for a millisecond.",
	"“Duff” is the decaying organic matter found on a forest floor.",
	"It is impossible to drown and not die. Technically the term ‘drowning’ refers to the process of taking water into the lungs, not to death caused by that process.",
	"Camels have three eyelids to protect themselves from blowing sand.",
	"11% of the world is left-handed.",
	"The Falkland Isles (pop. about 2000) has over 700000 sheep (350 per person).",
	"The average Japanese household watches more than 10 hours of television a day.",
	"The Brimstone butterfly (Gonepterix rhamni) has the longest lifetime of the adult butterflies: 9-10 months.",
	"A female ferret will die if it goes into heat and cannot find a mate.",
	"A full moon is nine times brighter than a half moon.",
	"An average human loses about 200 head hairs per day.",
	"Dartboards are made out of horse hairs.",
	"On average, 2 newborns will be given to the wrong parents every day.",
	"In the U.S, Frisbees outsell footballs, baseballs and basketballs combined.",
	"The human body is comprised of 80% water.",
	"It is believed that Leonardo Da Vinci invented the scissors.",
	"Despite a population of over a billion, China has only about 200 family names.",
	"Buckingham Palace has 602 rooms.",
	"The human heart creates enough pressure when it pumps out to the body to squirt blood 30 feet.",
	"Beethoven dipped his head in cold water before he composed.",
	"The Olympic was the sister ship of the Titanic, and she provided twenty-five years of service.",
	"Your ribs move about 5 million times a year, every time you breathe!",
	"Banging your head against a wall uses 150 calories an hour.",
	"Starfish have no brains.",
	"Children grow faster in the springtime.",
	"The national anthem of Greece has 158 verses.",
	"During it’s lifetime an oyster changes its sex from male to female and back several times.",
	"Cephalacaudal recapitulation is the reason our extremities develop faster than the rest of us.",
	"Nutmeg is extremely poisonous if injected intravenously.",
	"Daniel Boone hated coonskin caps.",
	"More people speak English in China than the United States.",
	"Butterflies taste with their hind feet.",
	"1 in 5 of the world’s doctors are Russian.",
	"Rape is reported every six minutes in the U.S.",
	"Two-thirds of the world’s eggplant is grown in New Jersey.",
	"Olympus Mons is the largest volcano in our solar system.",
	"Venus is the only planet that rotates clockwise.",
	"In space you cannot cry because there is no gravity to make the tears flow.",
	"Elephants have the longest pregnancy in the animal kingdom at 22 months. The longest human pregnancy on record is 17 months, 11 days.",
	"California consumes more bottled water than any other product.",
	"In 1936, American track star Jesse Owens beat a race horse over a 100-yard course. The horse was given a head start.",
	"A large flawless emerald is worth more than a similarly large flawless diamond.",
	"Cher’s last name was “Sarkissian.” She changed it because no one could pronounce it.",
	"Mexican free-tailed bats sometimes fly up to two miles high to feed or to catch tail-winds that carry them over long distances at speeds of more than 60 miles per hour.",
	"A man will ejaculate approximately 18 quarts of semen in his lifetime.",
	"It is estimated that millions of trees are planted by forgetful squirrels."
]